src/InformationRegisters/Секреты/Секреты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Секреты</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецСекрета</name>
    <type>
      <types>CatalogRef.Заметки</types>
      <types>CatalogRef.Задачи</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСекрета</name>
    <type>
      <types>CatalogRef.ВидыСекретов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Секреты/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СкопироватьСекрет(Команда)
	
	СохранитьВБуферОбмена(ПрочитатьСекрет());
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьСекрет()
	
	Результат = "";
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Секреты.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.Секреты КАК Секреты
	|ГДЕ
	|	Секреты.ВладелецСекрета = &ВладелецСекрета
	|	И Секреты.ВидСекрета = &ВидСекрета";
	
	Запрос.УстановитьПараметр("ВидСекрета", ТекущаяСтрока.ВидСекрета);
	Запрос.УстановитьПараметр("ВладелецСекрета", ТекущаяСтрока.ВладелецСекрета);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.Значение.Получить();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СохранитьВБуферОбмена(Текст) Экспорт
	
	ВебФайл = Новый COMОбъект("htmlfile");
	ВебФайл.ParentWindow.ClipboardData.Setdata("Text", Текст);
	
КонецПроцедуры
